#include <iostream>
#include <string>

using namespace std;

/*Задача 1. Банкомат 4.0.

В банке ПлюсПлюсБанк решили улучшить новую систему пин-кодов на банкоматы. 
Пользователям оказалось неудобно вводить 4 отдельных числа. 
Перепишите программу так, чтобы пользователь вводил число любой длины, а дальше все то же самое: 
если сумма цифр числа оказывается равна 42, пользователь может продолжать работу.

Напишите программу, которая спрашивает у пользователя число и отвечает “Ввод корректный”, 
если сумма его цифр равна 42, и “Ввод некорректный” в противном случае. 
При этом у пользователя есть только одна попытка ввести корректное число.*/

int main() 
{
	setlocale(LC_ALL,"ru");

	string number;
	int sum = 0;

	cout << "Введите число: ";
	cin >> number;

	int i = 0;

	while (i < number.length() ) 
	{
		sum += number[i] - '0';
		i++;
	}

	if (sum == 42)
		cout << "Ввод корректный" << endl;
	else 
		cout << "Ввод некорректный" << endl;
	

	return 0;
}