#include <iostream>
using namespace std;

/*Задача 1.
Что нужно сделать:
Напишите функцию, принимающую два указателя на int и меняющую местами содержимое этих указателей.*/

//-------------------------------------------------------------------------
void swap(int* ptr1, int* ptr2)
{
	int temp = *ptr1;
	*ptr1 = *ptr2;
	*ptr2 = temp;
}
//-------------------------------------------------------------------------
int main()
{
	int a = 10;
	int b = 20;

	swap(&a, &b);

	cout << a << " " << b << endl;  // Выведет: 20 10

	return 0;
}
//-------------------------------------------------------------------------