#include<iostream>
#include<cstring>
using namespace std;

/*Задача 3
Что нужно сделать:
Написать функцию, которая принимает указатель на char, по которому лежит строка.
Функция должна возвращать true, если вторая строка является подстрокой первой.*/

//--------------------------------------------------------------------------------------------------------
bool substr(const char *str, const char *sub)
{
	return strstr(str, sub) != nullptr;
}
//--------------------------------------------------------------------------------------------------------
int main()
{
	const char *a = "Hello world";
	const char *b = "wor";
	const char *c = "banana";

	cout << boolalpha << substr(a, b) << " " << substr(a, c) << endl;

	return 0;
}
//--------------------------------------------------------------------------------------------------------