// Теория и практика.
/* Задание - Дан текст с информацией о персонаже игры. Напишите программу, 
которая выводит этот текст. Вынесите из текста все числа в переменные, 
придумайте для них хорошие имена и выведите на экран.

===================

Супер гонки. Круг 4

===================

Шумахер (358)

===================

Водитель: Шумахер

Скорость: 358

-------------------

Оснащение

Двигатель: +254

Колеса: +93

Руль: +49

-------------------

Действия плохой погоды

Ветер: -21

Дождь: -17*/

#include <iostream>
using namespace std;

int main() 
{
    setlocale(LC_ALL,"ru");
    
    int mumCircles = 4;
    int speedCar = 358;
    int engineCar = 254;
    int wheelsCar = 93;
    int wheelCar = 49;
    int weaWind = 21;
    int weaRain = 17;
    
    
    cout << "==========================\n";
    cout << "Супер гонки. Круг "<< mumCircles << "\n";
    cout << "==========================\n";
    cout << "Шумахер "<< speedCar << "\n";
    cout << "==========================\n";
    cout << "Водитель: Шумахер\n";
    cout << "Скорость: "<< speedCar << "\n";
    cout << "==========================\n";
    cout << "Оснащение\n";
    cout << "Двигатель: "<< engineCar << "\n";
    cout << "Колеса: "<< wheelsCar << "\n";
    cout << "Руль: "<< wheelCar << "\n";
    cout << "==========================\n";
    cout << "Действия плохой погоды\n";
    cout << "Ветер:- "<< weaWind << "\n";
    cout << "Дождь:- "<< weaRain << "\n";
    cout << "==========================\n";
}